Тестовая_база_ERP_14/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/АГ_НадежностьКонтрагентаИЛСО/АГ_НадежностьКонтрагентаИЛСО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АГ_НадежностьКонтрагентаИЛСО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Надежность</name>
    <type>
      <types>EnumRef.АГ_НадежностьПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СтепеньНадежности</name>
    <type>
      <types>EnumRef.АГ_СтепениНадежностиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/АГ_СтатусТендера/АГ_СтатусТендера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_СтатусТендера</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеРезультата</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеАукциона</name>
  </enumValues>
  <enumValues>
    <name>ОтказОтУчастия</name>
  </enumValues>
  <enumValues>
    <name>Победа</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Поражение</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаНеСостоялась</name>
  </enumValues>
  <enumValues>
    <name>ПодготовкаТКП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеТКП</name>
  </enumValues>
  <enumValues>
    <name>НазначениеМенеджера</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ПодачаДокументов</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/АГ_ШагиТендера/АГ_ШагиТендера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_ШагиТендера</name>
  <enumValues>
    <name>Шаг1_ПередачаВРаботу</name>
  </enumValues>
  <enumValues>
    <name>Шаг2_Распределение</name>
  </enumValues>
  <enumValues>
    <name>Шаг3_ПредварительноеПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>Шаг4_Согласование</name>
  </enumValues>
  <enumValues>
    <name>Шаг5_ПередачаКоммерческойИТехЧасти</name>
  </enumValues>
  <enumValues>
    <name>Шаг6_ПодачаДокументов</name>
  </enumValues>
  <enumValues>
    <name>Шаг7_Результат</name>
  </enumValues>
  <enumValues>
    <name>Шаг8_ОбязательстваВыполнены</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/АГ_НадежностьПокупателя/АГ_НадежностьПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_НадежностьПокупателя</name>
  <comment>АГ:[+][SAPDZ_0001_2][16.03.2019 15:45][Фирсанов]</comment>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/АГ_Тендер/АГ_Тендер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_Тендер</name>
  <registerRecords>InformationRegister.АГ_ИсторияТендеров</registerRecords>
  <attributes>
    <name>НомерЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагТендера</name>
    <type>
      <types>EnumRef.АГ_ШагиТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОПЗ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодведенияИтогов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАукциона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НМЦ</name>
    <comment>Начальная минимальная цена лота</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПревышениеНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПродавец</name>
    <type>
      <types>EnumRef.АГ_ОрганизацияПродавец</types>
    </type>
  </attributes>
  <attributes>
    <name>НашеЦеновоеПредложение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаДляМСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГОЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодачиПредложения</name>
    <type>
      <types>EnumRef.АГ_ВидПодачиПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортамент</name>
    <type>
      <types>EnumRef.АГ_Сортамент</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭТП</name>
    <type>
      <types>CatalogRef.АГ_ЭлектронныеТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРаспределение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаМониторинг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТендера</name>
    <type>
      <types>EnumRef.АГ_СтатусТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиОЭТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиМП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеучастия</name>
    <type>
      <types>CatalogRef.АГ_ПричиныНеучастияВТендере</types>
    </type>
  </attributes>
  <attributes>
    <name>Победитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоннажПобеды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПобеды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЗаключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметИОсобенностиЗакупки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПротокола</name>
    <type>
      <types>CatalogRef.АГ_ТендерПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйКураторОЭТ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПоставки</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеЗаявкиПримечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеДоговораПримечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииОценки</name>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.АГ_КритерииОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>EnumRef.АГ_ШагиТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтатуса</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСогласования</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.АГ_РолиСогласованияТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.АГ_РезультатСогласованияТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеучастия</name>
      <type>
        <types>CatalogRef.АГ_ПричиныНеучастияВТендере</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПоЗаявке</name>
    <attributes>
      <name>ПрисоединенныйФайл</name>
      <type>
        <types>CatalogRef.АГ_ТендерПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/CommonModules/АГ_РегламентныеЗаданияСерверный/Module.bsl
Процедура СнятиеРезервов() Экспорт
	
	Если ЗначениеЗаполнено(Константы.АГ_КоличествоДнейРезерваНаСкладе.Получить()) Тогда
		ДатаСреза = РЭЙ_СлужебныйСервер.ОпределитьДату(ТекущаяДата(),-Константы.АГ_КоличествоДнейРезерваНаСкладе.Получить()-1);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
		               |	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
		               |	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
		               |	ТоварыКОтгрузкеОстатки.Серия КАК Серия,
		               |	ТоварыКОтгрузкеОстатки.ВРезервеОстаток КАК ВРезервеОстаток
		               |ИЗ
		               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		               |			&ДатаСреза,
		               |			ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
		               |				И ДокументОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению)) КАК ТоварыКОтгрузкеОстатки
		               |ГДЕ
		               |	ТоварыКОтгрузкеОстатки.ВРезервеОстаток > 0";
		
		Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(КонецДня(ДатаСреза),ВидГраницы.Включая));
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			
		
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры	


//<--АГ:[TEND_0001_24][04.03.2019 21:07:51][Фирсанов О.И.]
Процедура ИзменениеСтатусовТендеров() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АГ_Тендер.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА &ТекущаяДата< АГ_Тендер.ОПЗ 
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АГ_СтатусТендера.ПодачаДокументов)
		|		КОГДА АГ_Тендер.ОПЗ <= &ТекущаяДата
		|				И АГ_Тендер.ДатаПодведенияИтогов > &ТекущаяДата
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АГ_СтатусТендера.ОжиданиеРезультата)
		|		ИНАЧЕ АГ_Тендер.СтатусТендера
		|	КОНЕЦ КАК НовыйСтатус
		|ИЗ
		|	Документ.АГ_Тендер КАК АГ_Тендер
		|ГДЕ
		|	АГ_Тендер.ШагТендера = ЗНАЧЕНИЕ(Перечисление.АГ_ШагиТендера.Шаг6_ПодачаДокументов)
		|	И ВЫБОР
		|			КОГДА &ТекущаяДата< АГ_Тендер.ОПЗ
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АГ_СтатусТендера.ПодачаДокументов)
		|			КОГДА &ТекущаяДата>=АГ_Тендер.ОПЗ 
		|					И &ТекущаяДата<АГ_Тендер.ДатаПодведенияИтогов
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.АГ_СтатусТендера.ОжиданиеРезультата)
		|			ИНАЧЕ АГ_Тендер.СтатусТендера
		|		КОНЕЦ <> АГ_Тендер.СтатусТендера
		|	И АГ_Тендер.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОбъект	= ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ОбновитьСтатусДокумента = Истина;
		Попытка 
			ДокументОбъект.Заблокировать();
		Исключение
			// в случае блокировки - не выполнять изменение объекта
			ОбновитьСтатусДокумента = Ложь;
			// записать предупреждение в журнал регистрации
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое обновление статусов тендеров'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Предупреждение,Метаданные.Документы.АГ_Тендер, ДокументОбъект, ОписаниеОшибки());
		КонецПопытки;
		
		// Пропустить обработку объекта, если он заблокирован.
		Если ОбновитьСтатусДокумента Тогда
			ДокументОбъект.СтатусТендера = ВыборкаДетальныеЗаписи.НовыйСтатус;
			ДокументОбъект.Записать();
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое обновление статусов тендеров'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Информация,Метаданные.Документы.АГ_Тендер, ДокументОбъект, "Установлен новый статус:"+ВыборкаДетальныеЗаписи.НовыйСтатус);
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры
//-->АГ:[TEND_0001_24]


//<--АГ:[SAPDZ_0001_8][24.03.2019 21:07:51][Фирсанов О.И.]
Процедура УведомлениеОбОкончанииСроковКредитныхЛимитов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Партнер.Наименование КАК ПартнерНаименование,
		|	ДоговорыКонтрагентов.АГ_СрокКредитногоЛимита КАК АГ_СрокКредитногоЛимита,
		|	ДоговорыКонтрагентов.Менеджер КАК Менеджер
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.АГ_СрокКредитногоЛимита <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И РАЗНОСТЬДАТ(&ТекущаяДата, ДоговорыКонтрагентов.АГ_СрокКредитногоЛимита,  ДЕНЬ) <= 5
		|	И РАЗНОСТЬДАТ(&ТекущаяДата, ДоговорыКонтрагентов.АГ_СрокКредитногоЛимита,  ДЕНЬ) >= 0
		|	И (ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата
		|			ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметры	= Новый Структура("Договор,ПартнерНаименование,Менеджер,АГ_СрокКредитногоЛимита");
		ЗаполнитьЗначенияСвойств(СтруктураПараметры,ВыборкаДетальныеЗаписи);
		
		ПараметрыОтправки	= СтруктураПараметровПисьмаОбОкончанииСроковКредитныхЛимитов(СтруктураПараметры);
		
		РезультатОтправки	= ОтправитьПисьмоОтветственному(СтруктураПараметры,ПараметрыОтправки);
		
		Если НЕ РезультатОтправки Тогда
			ОписаниеОшибки	= "Не удалось отправить письмо";
			Если ТипЗнч(ПараметрыОтправки)=Тип("Структура") Тогда
				ПараметрыОтправки.Свойство("ОписаниеОшибки",ОписаниеОшибки);
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое отправка уведомлений об окончании сроков кредитных лимитов'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Предупреждение,,,ОписаниеОшибки);	
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УведомлениеОбОкончанииСроковНадежностиПокупателей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.Контрагент КАК Контрагент,
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.Контрагент.Партнер КАК Партнер,
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.Контрагент.Партнер.Наименование КАК ПартнерНаименование,
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.Контрагент.Партнер.ОсновнойМенеджер КАК Менеджер,
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо  КАК ДействуетДо
		|ИЗ
		|	РегистрСведений.АГ_НадежностьКонтрагентаИЛСО.СрезПоследних КАК АГ_НадежностьКонтрагентаИЛСОСрезПоследних
		|ГДЕ
		//<--АГ:[SAPDZ_0001_8][30.05.2019 21:07:51][Фирсанов О.И.]
		//|	РАЗНОСТЬДАТ(&ТекущаяДата,НАЧАЛОПЕРИОДА(АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо, ДЕНЬ),  ДЕНЬ)<= 3
		//|	И РАЗНОСТЬДАТ(&ТекущаяДата,НАЧАЛОПЕРИОДА(АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо, ДЕНЬ),  ДЕНЬ)>= 0";
		|	РАЗНОСТЬДАТ(&ТекущаяДата,НАЧАЛОПЕРИОДА(АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо, ДЕНЬ),  ДЕНЬ)<= 7
		|	И РАЗНОСТЬДАТ(&ТекущаяДата,НАЧАЛОПЕРИОДА(АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо, ДЕНЬ),  ДЕНЬ)>= 0
		|	ИЛИ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо, ДЕНЬ), МЕСЯЦ, 1)=&ТекущаяДата";
	    //-->АГ:[SAPDZ_0001_8]
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметры	= Новый Структура("Контрагент,ПартнерНаименование,Менеджер,ДействуетДо");
		ЗаполнитьЗначенияСвойств(СтруктураПараметры,ВыборкаДетальныеЗаписи);
		
		ПараметрыОтправки	= СтруктураПараметровПисьмаОбОкончанииСроковНадежностиПокупателей(СтруктураПараметры);
		
		РезультатОтправки	= ОтправитьПисьмоОтветственному(СтруктураПараметры,ПараметрыОтправки);
		Если НЕ РезультатОтправки Тогда
			ОписаниеОшибки	= "Не удалось отправить письмо";
			Если ТипЗнч(ПараметрыОтправки)=Тип("Структура") Тогда
				ПараметрыОтправки.Свойство("ОписаниеОшибки",ОписаниеОшибки);
			КонецЕсли;	
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Фоновое отправка уведомлений об окончании сроков надежности клиентов'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Предупреждение,Метаданные.Справочники.Контрагенты,ВыборкаДетальныеЗаписи.Контрагент,ОписаниеОшибки);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеНизкойНадежностиПокупателейДляПросроченныхЗаписей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.АГ_НадежностьКонтрагентаИЛСО.СрезПоследних КАК АГ_НадежностьКонтрагентаИЛСОСрезПоследних
		|ГДЕ
		|	АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо < &ТекущаяДата
		|	И АГ_НадежностьКонтрагентаИЛСОСрезПоследних.ДействуетДо <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи	= РегистрыСведений.АГ_НадежностьКонтрагентаИЛСО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период	= ТекущаяДата();
		МенеджерЗаписи.Автор	= ПользователиКлиентСервер.ТекущийПользователь();
		МенеджерЗаписи.ДействуетДо	= НачалоДня(МенеджерЗаписи.Период)+ 60*60*24*7; //+1 неделя
		МенеджерЗаписи.Контрагент	= ВыборкаДетальныеЗаписи.Контрагент;
		МенеджерЗаписи.Надежность	= Перечисления.АГ_НадежностьПокупателя.Низкая;
		МенеджерЗаписи.Записать(Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьПисьмоОтветственному(Параметры,ПараметрыОтправки)
	
	Если ПараметрыОтправки=Неопределено Тогда
		
		Возврат Ложь;
	КонецЕсли;	
	
	ДоступныеУчетныеЗаписи	= РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина,,Истина);
	Если ДоступныеУчетныеЗаписи.Количество()>0 Тогда
		
		УчетнаяЗапись	= ДоступныеУчетныеЗаписи[0].Ссылка;
		
		РезультатОтправки	= РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись,ПараметрыОтправки);
		
		Параметры.Вставить("ОписаниеОшибки",РезультатОтправки);
		
		Возврат (РезультатОтправки<>Неопределено);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СтруктураПараметровПисьмаОбОкончанииСроковКредитныхЛимитов(СтруктураПараметрыОтправки)
	
	Если НЕ РаботаСПочтовымиСообщениями.ДоступнаОтправкаПисем() Тогда
		СтруктураПараметрыОтправки.Вставить("ОписаниеОшибки","Не настроена отправка писем");
		Возврат Неопределено;	
	КонецЕсли;
	
	ПараметрыОтправки = Новый Структура("Тема,Получатель,Кому,Предмет,Текст,Тело");
	
	ПараметрыОтправки.Тема = "ВНИМАНИЕ! Окончание срока кредитного лимита по контрагенту «"+СтруктураПараметрыОтправки.ПартнерНаименование+"»";
	ПараметрыОтправки.Текст	= "ВНИМАНИЕ! По договору "+СтруктураПараметрыОтправки.Договор
	+" клиента «"+СтруктураПараметрыОтправки.ПартнерНаименование
	+"» подходит к окончанию срок кредитного лимита ( действует до "+Формат(СтруктураПараметрыОтправки.АГ_СрокКредитногоЛимита,"ДЛФ=D")+")";
	
	МассивПолучателей	= Новый Массив;
	Кому	= "";
	
	Если ЗначениеЗаполнено(СтруктураПараметрыОтправки.Менеджер) Тогда
		АдресЭлПочты	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураПараметрыОтправки.Менеджер,ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"));
		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			ПолучательСтруктура	= Новый Структура("Адрес,Представление,ИсточникКонтактнойИнформации",АдресЭлПочты,Строка(СтруктураПараметрыОтправки.Менеджер),СтруктураПараметрыОтправки.Менеджер);
			МассивПолучателей.Добавить(ПолучательСтруктура);
			Кому	= АдресЭлПочты;
		Иначе
			СтруктураПараметрыОтправки.Вставить("ОписаниеОшибки","Не заполнен адрес пользователя:"+СтруктураПараметрыОтправки.Менеджер);
		КонецЕсли;                                                            
	Иначе
		СтруктураПараметрыОтправки.Вставить("ОписаниеОшибки","Не заполнен менеджер по договору "+СтруктураПараметрыОтправки.Договор+" клиента "+СтруктураПараметрыОтправки.ПартнерНаименование);	
	КонецЕсли;
	
	Если МассивПолучателей.Количество() = 0 Тогда
		ПараметрыОтправки	= Неопределено;
	Иначе	
		ПараметрыОтправки.Получатель= МассивПолучателей;
		ПараметрыОтправки.Кому		= Кому;
		ПараметрыОтправки.Предмет	= СтруктураПараметрыОтправки.Договор;
		ПараметрыОтправки.Тело      = ПараметрыОтправки.Текст;	
	КонецЕсли;	
	
	Возврат ПараметрыОтправки;
	
КонецФункции

Функция СтруктураПараметровПисьмаОбОкончанииСроковНадежностиПокупателей(СтруктураПараметрыОтправки)
	
	Если НЕ РаботаСПочтовымиСообщениями.ДоступнаОтправкаПисем() Тогда
		СтруктураПараметрыОтправки.Вставить("ОписаниеОшибки","Не настроена отправка писем");
		Возврат Неопределено;	
	КонецЕсли;
	
	ПараметрыОтправки = Новый Структура("Тема,Получатель,Кому,Предмет,Текст,Тело");
	
	ПараметрыОтправки.Тема = "ВНИМАНИЕ! Окончание срока надежности по клиенту «"+СтруктураПараметрыОтправки.ПартнерНаименование+"»";
	ПараметрыОтправки.Текст	= "ВНИМАНИЕ! По клиенту  «"+СтруктураПараметрыОтправки.ПартнерНаименование
	+"» подходит к окончанию срок надежности (действует до "+Формат(СтруктураПараметрыОтправки.ДействуетДо,"ДЛФ=D")+")."
	+Символы.ПС+"Необходимо продлить срок надежности.";
	
	МассивПолучателей	= Новый Массив;
	Кому	= "";
	
	Если ЗначениеЗаполнено(СтруктураПараметрыОтправки.Менеджер) Тогда
		АдресЭлПочты	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураПараметрыОтправки.Менеджер,ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"));
		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			ПолучательСтруктура	= Новый Структура("Адрес,Представление,ИсточникКонтактнойИнформации",АдресЭлПочты,Строка(СтруктураПараметрыОтправки.Менеджер),СтруктураПараметрыОтправки.Менеджер);
			МассивПолучателей.Добавить(ПолучательСтруктура);
			Кому	= АдресЭлПочты;
		Иначе
			СтруктураПараметрыОтправки.Вставить("ОписаниеОшибки","Не заполнен адрес пользователя:"+СтруктураПараметрыОтправки.Менеджер);
		КонецЕсли;                                                            
	Иначе
		СтруктураПараметрыОтправки.Вставить("ОписаниеОшибки","Не заполнен менеджер по клиенту "+СтруктураПараметрыОтправки.ПартнерНаименование);	
	КонецЕсли;
	
	Если МассивПолучателей.Количество() = 0 Тогда
		ПараметрыОтправки	= Неопределено;
	Иначе	
		ПараметрыОтправки.Получатель= МассивПолучателей;
		ПараметрыОтправки.Кому		= Кому;
		ПараметрыОтправки.Предмет	= СтруктураПараметрыОтправки.Контрагент;
		ПараметрыОтправки.Тело      = ПараметрыОтправки.Текст;	
	КонецЕсли;	
	
	Возврат ПараметрыОтправки;
	
КонецФункции

//-->АГ:[SAPDZ_0001_8]
